telespial/EdgeAI_smart_pong_demo_NXP_FRDM-MCXN947/sdk_example/mcuxsdk_examples_overlay/_boards/frdmmcxn947/demo_apps/edgeai_smart_pong_demo/pin_mux.h
/*
 * Copyright 2026
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

#if defined(__cplusplus)
extern "C" {
#endif

void BOARD_InitBootPins(void);
void BOARD_InitPins(void);
void BOARD_InitLcdPins(void);

#if defined(__cplusplus)
}
#endif

#endif /* _PIN_MUX_H_ */
